app/views/users/show.html.haml

SELECT `lessons`.* FROM `lessons` WHERE `lessons`.`user_id` = 3
---
        %h2= "#{@user.name}が投稿したレッスン一覧"
        -@user.lessons.each do |lesson|
          .list