app/views/lessons/index.html.haml

SELECT `lessons`.* FROM `lessons` WHERE `lessons`.`user_id` = 3
---
            %h2 投稿したレッスン一覧
            -current_user.lessons.each do |lesson|
              .list