app/views/lessons/show.html.haml

SELECT `products`.* FROM `products` WHERE `products`.`lesson_id` = 6
---
      %h2= "#{@lesson.title}の教材一覧"
      -@lesson.products.each do |product|