app/controllers/lessons_controller.rb

SELECT `users`.* FROM `users`
SELECT `lessons`.* FROM `lessons`
---
  def index
    @users = User.all
    @lessons = Lesson.all

SELECT  `lessons`.* FROM `lessons` WHERE `lessons`.`id` = 6 LIMIT 1
---
  def show
    @lesson = Lesson.find(params[:id])

INSERT INTO `lessons` (`body`, `image`, `title`, `user_id`, `created_at`, `updated_at`) VALUES ('Unity（別名:Unity3D）とは、統合開発環境を内蔵し、複数のプラットホームに対応するゲームエンジンである。 ユニティ・テクノロジーズが開発した。', '#<ActionDispatch::Http::UploadedFile:0x007ff5ea52d608>', 'unity', 3, '2017-12-02 11:58:31', '2017-12-02 11:58:31')
---
  def create
    @lesson = Lesson.new(lesson_params)
      if @lesson.save

SELECT  `lessons`.* FROM `lessons` WHERE `lessons`.`id` = 2 LIMIT 1
---
  def edit
    @lesson = Lesson.find(params[:id])

SELECT  `lessons`.* FROM `lessons` WHERE `lessons`.`id` = 1 LIMIT 1
UPDATE `lessons` SET `title` = 'スクラッチ講座', `body` = 'Scratch (スクラッチ) とは初心者が、プログラミングの正しい構文の書き方を覚えること無く学習ができるプログラミング言語学習環境です。MITメディアラボが開発し、遊び心のある実験やインタラクティブアニメーション、ゲームなどの製作を通してさらなる学習のやる気を起こさせることを目的とした教材です。', `image` = 'scratch.jpg', `updated_at` = '2017-12-05 11:12:40' WHERE `lessons`.`id` = 6
---
  def update
    @lesson = Lesson.find(params[:id])
      if @lesson.user_id==current_user.id
        @lesson.update(lesson_params)

SELECT  `lessons`.* FROM `lessons` WHERE `lessons`.`id` = 1 LIMIT 1
DELETE FROM `lessons` WHERE `lessons`.`id` = 1
---
  def destroy
    @lesson = Lesson.find(params[:id])
      if @lesson.user_id==current_user.id
        @lesson.destroy