app/controllers/products_controller.rb

SELECT  `lessons`.* FROM `lessons` WHERE `lessons`.`id` = NULL LIMIT 1
---
  def new
    @product = Product.new
    @lesson = Lesson.find(params[:lesson_id])

SELECT  `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
SELECT  `lessons`.* FROM `lessons` WHERE `lessons`.`id` = 6 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 ORDER BY `users`.`id` ASC LIMIT 1
---
  def show
    @product = Product.find(params[:id])
    @lesson = Lesson.find(params[:lesson_id])
    if @product.lesson.user_id==current_user.id || @product.free != 'limited'
    elsif current_user.subscription_id.present?
      begin
      Payjp.api_key = Rails.application.secrets.payjp_secret_key
      subscription = Payjp::Subscription.retrieve(current_user.subscription_id)
      if subscription.status == 'active'
      else
        subscription.delete
        @user = User.find(current_user)

SELECT  `lessons`.* FROM `lessons` WHERE `lessons`.`id` = 6 LIMIT 1
INSERT INTO `products` (`body`, `pdf`, `title`, `lesson_id`, `created_at`, `updated_at`, `url`) VALUES ('スクラッチ講座の第1回目の授業です', 'scratch_vol2.pdf', 'スクラッチ第1回', 6, '2017-12-05 10:00:17', '2017-12-05 10:00:17', 'https://www.youtube.com/watch?v=yZ6S-cvTYDs')
---
  def create
    @product = Product.new(product_params)
    @lesson = Lesson.find(params[:lesson_id])
      if @product.save

SELECT  `products`.* FROM `products` WHERE `products`.`id` = 5 LIMIT 1
SELECT  `lessons`.* FROM `lessons` WHERE `lessons`.`id` = 7 LIMIT 1
---
  def edit
    @product = Product.find(params[:id])
    @lesson = Lesson.find(params[:lesson_id])

SELECT  `products`.* FROM `products` WHERE `products`.`id` = 5 LIMIT 1
SELECT  `lessons`.* FROM `lessons` WHERE `lessons`.`id` = 7 LIMIT 1
UPDATE `products` SET `url` = 'https://www.youtube.com/watch?v=GODLux65Xqg', `updated_at` = '2017-12-05 12:17:31' WHERE `products`.`id` = 5
---
  def update
    @product = Product.find(params[:id])
    @lesson = Lesson.find(params[:lesson_id])
      if @product.lesson.user_id==current_user.id
        @product.update(product_params)

SELECT  `products`.* FROM `products` WHERE `products`.`id` = 2 LIMIT 1
SELECT  `lessons`.* FROM `lessons` WHERE `lessons`.`id` = 6 LIMIT 1
DELETE FROM `lessons` WHERE `lessons`.`id` = 6
DELETE FROM `products` WHERE `products`.`id` = 1
---
  def destroy
    @product = Product.find(params[:id])
    @lesson = Lesson.find(params[:lesson_id])
      if @product.lesson.user_id==current_user.id
        @product.destroy