app/controllers/users_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `users` SET `body` = '小中高生向けIT/プログラミングスクール', `updated_at` = '2017-12-02 09:47:27' WHERE `users`.`id` = 3
---
    def update
      @user = User.find(params[:id])
      if @user.id==current_user.id
        current_user.update(user_params)